joaquimorg/Adafruit_nRF52_Arduino/boards.txt
menu.softdevice=SoftDevice
menu.debug=Debug
menu.debug_output=Debug Output

# -----------------------------------
# Pine64 Pinetime nRF52832
# -----------------------------------
pinetime52832.name=Pine64 Pinetime nRF52832

# VID/PID for Bootloader, Arduino & CircuitPython

# Upload
pinetime52832.bootloader.tool=bootburn
pinetime52832.upload.tool=openocd
pinetime52832.upload.protocol=openocd
pinetime52832.upload.use_1200bps_touch=false
pinetime52832.upload.wait_for_upload_port=false
pinetime52832.upload.native_usb=false
pinetime52832.upload.maximum_size=344064
pinetime52832.upload.maximum_data_size=56576

# Build
pinetime52832.build.mcu=cortex-m4
pinetime52832.build.f_cpu=64000000
pinetime52832.build.board=NRF52832_PINETIME
pinetime52832.build.core=nRF5
pinetime52832.build.variant=pinetime_nrf52832
pinetime52832.build.usb_manufacturer="Pine64"
pinetime52832.build.usb_product="Pinetime nRF52832"
pinetime52832.build.extra_flags=-DNRF52832_XXAA -DS112 -DNRF52 -DNRF52_PAN_74 -DNRF52_PAN_64 -DNRF52_PAN_12 -DNRF52_PAN_58 -DNRF52_PAN_54 -DNRF52_PAN_31 -DNRF52_PAN_51 -DNRF52_PAN_36 -DNRF52_PAN_15 -DNRF52_PAN_20 -DNRF52_PAN_55 -DBOARD_PCA10040
#pinetime52832.build.ldscript=nrf52832_s132_v6.ld
pinetime52832.build.ldscript=nrf52832_s112_v6.ld

# SoftDevice Menu
pinetime52832.menu.softdevice.s112v6=S112 6.1.1
pinetime52832.menu.softdevice.s112v6.build.sd_name=s112
pinetime52832.menu.softdevice.s112v6.build.sd_version=6.1.1
pinetime52832.menu.softdevice.s112v6.build.sd_fwid=0x0103
#pinetime52832.menu.softdevice.s132v6=S132 6.1.1
#pinetime52832.menu.softdevice.s132v6.build.sd_name=s132
#pinetime52832.menu.softdevice.s132v6.build.sd_version=6.1.1
#pinetime52832.menu.softdevice.s132v6.build.sd_fwid=0x00B7

# Debug Menu
pinetime52832.menu.debug.l0=Level 0 (Release)
pinetime52832.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
pinetime52832.menu.debug.l1=Level 1 (Error Message)
pinetime52832.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
pinetime52832.menu.debug.l2=Level 2 (Full Debug)
pinetime52832.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
pinetime52832.menu.debug.l3=Level 3 (Segger SystemView)
pinetime52832.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
pinetime52832.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# -----------------------------------
# joaquimorg PineTime nRF52840
# -----------------------------------
pinetime40.name=joaquimorg PineTime nRF52840

# VID/PID for Bootloader, Arduino & CircuitPython

# Upload
pinetime40.bootloader.tool=bootburn
pinetime40.upload.tool=openocd
pinetime40.upload.protocol=openocd
pinetime40.upload.use_1200bps_touch=false
pinetime40.upload.wait_for_upload_port=false
pinetime40.upload.native_usb=false
pinetime40.upload.maximum_size=933888
pinetime40.upload.maximum_data_size=251744

# Build
pinetime40.build.mcu=cortex-m4
pinetime40.build.f_cpu=64000000
pinetime40.build.board=NRF52840_PINETIME
pinetime40.build.core=nRF5
pinetime40.build.variant=pinetime_nrf52840
pinetime40.build.usb_manufacturer="joaquimorg"
pinetime40.build.usb_product="PineTime nRF52840"
pinetime40.build.extra_flags=-DNRF52840_XXAA -DS113
pinetime40.build.ldscript=nrf52840_s113_v7.ld

# SoftDevice Menu
pinetime40.menu.softdevice.s140v6=S140 6.1.1
pinetime40.menu.softdevice.s140v6.build.sd_name=s140
pinetime40.menu.softdevice.s140v6.build.sd_version=6.1.1
pinetime40.menu.softdevice.s140v6.build.sd_fwid=0x00B6

pinetime40.menu.softdevice.s113v7=S113 7.3.0
pinetime40.menu.softdevice.s113v7.build.sd_name=s113
pinetime40.menu.softdevice.s113v7.build.sd_version=7.3.0
pinetime40.menu.softdevice.s113v7.build.sd_fwid=0x0125

# Debug Menu
pinetime40.menu.debug.l0=Level 0 (Release)
pinetime40.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
pinetime40.menu.debug.l1=Level 1 (Error Message)
pinetime40.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
pinetime40.menu.debug.l2=Level 2 (Full Debug)
pinetime40.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
pinetime40.menu.debug.l3=Level 3 (Segger SystemView)
pinetime40.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
pinetime40.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Debug Output Menu
pinetime40.menu.debug_output.serial=Serial
pinetime40.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
pinetime40.menu.debug_output.serial1=Serial1
pinetime40.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
pinetime40.menu.debug_output.rtt=Segger RTT
pinetime40.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL


# -----------------------------------
# Adafruit Feather nRF52832
# -----------------------------------
feather52832.name=Adafruit Feather nRF52832

# VID/PID for Bootloader, Arduino & CircuitPython

# Upload
feather52832.bootloader.tool=bootburn
feather52832.upload.tool=nrfutil
feather52832.upload.protocol=nrfutil
feather52832.upload.use_1200bps_touch=false
feather52832.upload.wait_for_upload_port=false
feather52832.upload.native_usb=false
feather52832.upload.maximum_size=290816
feather52832.upload.maximum_data_size=52224

# Build
feather52832.build.mcu=cortex-m4
feather52832.build.f_cpu=64000000
feather52832.build.board=NRF52832_FEATHER
feather52832.build.core=nRF5
feather52832.build.variant=feather_nrf52832
feather52832.build.usb_manufacturer="Adafruit"
feather52832.build.usb_product="Feather nRF52832"
feather52832.build.extra_flags=-DNRF52832_XXAA -DNRF52
feather52832.build.ldscript=nrf52832_s132_v6.ld

# SoftDevice Menu
feather52832.menu.softdevice.s132v6=S132 6.1.1
feather52832.menu.softdevice.s132v6.build.sd_name=s132
feather52832.menu.softdevice.s132v6.build.sd_version=6.1.1
feather52832.menu.softdevice.s132v6.build.sd_fwid=0x00B7

# Debug Menu
feather52832.menu.debug.l0=Level 0 (Release)
feather52832.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
feather52832.menu.debug.l1=Level 1 (Error Message)
feather52832.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
feather52832.menu.debug.l2=Level 2 (Full Debug)
feather52832.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
feather52832.menu.debug.l3=Level 3 (Segger SystemView)
feather52832.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
feather52832.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Debug Output Menu
feather52832.menu.debug_output.serial=Serial
feather52832.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
feather52832.menu.debug_output.serial1=Serial1
feather52832.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
feather52832.menu.debug_output.rtt=Segger RTT
feather52832.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# -----------------------------------
# Adafruit Feather nRF52840 Express
# -----------------------------------
feather52840.name=Adafruit Feather nRF52840 Express

# VID/PID for Bootloader, Arduino & CircuitPython
feather52840.vid.0=0x239A
feather52840.pid.0=0x8029
feather52840.vid.1=0x239A
feather52840.pid.1=0x0029
feather52840.vid.2=0x239A
feather52840.pid.2=0x002A
feather52840.vid.3=0x239A
feather52840.pid.3=0x802A

# Upload
feather52840.bootloader.tool=bootburn
feather52840.upload.tool=nrfutil
feather52840.upload.protocol=nrfutil
feather52840.upload.use_1200bps_touch=true
feather52840.upload.wait_for_upload_port=true
feather52840.upload.maximum_size=815104
feather52840.upload.maximum_data_size=237568

# Build
feather52840.build.mcu=cortex-m4
feather52840.build.f_cpu=64000000
feather52840.build.board=NRF52840_FEATHER
feather52840.build.core=nRF5
feather52840.build.variant=feather_nrf52840_express
feather52840.build.usb_manufacturer="Adafruit"
feather52840.build.usb_product="Feather nRF52840 Express"
feather52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
feather52840.build.ldscript=nrf52840_s140_v6.ld
feather52840.build.vid=0x239A
feather52840.build.pid=0x8029

